; domain
(define
	(domain solitaire)
	(:requirements :adl)
	(:predicates
		(trojka ?x ?y ?z)
		(pusty ?x)
	)
	(:action bij
		:parameters (?x ?y ?z)
		:precondition
		(and
			(or
				(trojka ?x ?y ?z)
				(trojka ?z ?y ?x)
			)
			(not (pusty ?y))
			(and
				(pusty ?z)
				(not (pusty ?x))
			)
		)
		:effect
		(and
			(pusty ?y)
			(not (pusty ?z))
			(pusty ?x)
		)
	)
	
)

; problem
(define (problem p1)
(:domain solitaire)
(:objects p1 p21 p22 p31 p32 p33 p41 p42 p43 p44 p51 p52 p53 p54 p55)
(:init
	(trojka p1 p21 p31)
	(trojka p21 p31 p41)
	(trojka p31 p41 p51)
	(trojka p22 p32 p42)
	(trojka p32 p42 p52)
	(trojka p33 p43 p53)
	
	(trojka p1 p22 p33)
	(trojka p22 p33 p44)
	(trojka p33 p44 p55)
	(trojka p21 p32 p43)
	(trojka p32 p43 p54)
	(trojka p31 p42 p53)
	
	(trojka p51 p52 p53)
	(trojka p52 p53 p54)
	(trojka p53 p54 p55)
	(trojka p41 p42 p43)
	(trojka p42 p43 p44)
	(trojka p31 p32 p33)
	
	(pusty p1)
)
(:goal 
	(and
		(pusty p21)
		(pusty p22)
		(pusty p31)
		(pusty p32)
		(pusty p33)
		(pusty p41)
		(pusty p42)
		(pusty p43)
		(pusty p44)
		(pusty p51)
		(pusty p52)
		(pusty p53)
		(pusty p54)
		(pusty p55)
	)
)
)

; plan
1. (bij p31 p21 p1)
   deleted: (pusty p1)
   added: (pusty p21) (pusty p31)
   goals met: 2 of 14
2. (bij p33 p32 p31)
   deleted: (pusty p31)
   added: (pusty p32) (pusty p33)
   goals met: 3 of 14
3. (bij p1 p22 p33)
   deleted: (pusty p33)
   added: (pusty p22) (pusty p1)
   goals met: 3 of 14
4. (bij p41 p31 p21)
   deleted: (pusty p21)
   added: (pusty p31) (pusty p41)
   goals met: 4 of 14
5. (bij p44 p33 p22)
   deleted: (pusty p22)
   added: (pusty p33) (pusty p44)
   goals met: 5 of 14
6. (bij p53 p42 p31)
   deleted: (pusty p31)
   added: (pusty p42) (pusty p53)
   goals met: 6 of 14
7. (bij p21 p31 p41)
   deleted: (pusty p41)
   added: (pusty p31) (pusty p21)
   goals met: 7 of 14
8. (bij p51 p41 p31)
   deleted: (pusty p31)
   added: (pusty p41) (pusty p51)
   goals met: 8 of 14
9. (bij p55 p54 p53)
   deleted: (pusty p53)
   added: (pusty p54) (pusty p55)
   goals met: 9 of 14
10. (bij p52 p53 p54)
   deleted: (pusty p54)
   added: (pusty p53) (pusty p52)
   goals met: 10 of 14
11. (bij p54 p43 p32)
   deleted: (pusty p32)
   added: (pusty p43) (pusty p54)
   goals met: 11 of 14
12. (bij p31 p32 p33)
   deleted: (pusty p33)
   added: (pusty p32) (pusty p31)
   goals met: 12 of 14
13. (bij p33 p22 p1)
   deleted: (pusty p1)
   added: (pusty p22) (pusty p33)
   goals met: 14 of 14
